

// ৪. Cookies কি জিনিস। এইটা দিয়ে কি করা হয়। সেটা ইংরেজিতে ৫ থেকে ৭ লাইনের মধ্যে লিখে ফেলো। 

// ৫. local storage আর session storage এর মধ্যে তিনটা পার্থক্য লিখে ফেলো। ইংরেজিতে। (নিজের মতো করে লিখবে )



// .



// [হোম ওয়ার্ক] 

// ৬. জাভাস্ক্রিপ্ট এর কোড কিভাবে ব্রাউজারের মধ্যে রান করে। দরকার হলে গুগল বা ইউটিউবে সার্চ দিয়ে একটু ভালো করে দেখে রাখো। 

// ৭. জাভাস্ক্রিপ্ট এর কোন কোন জিনিস asynchronous সেটার একটা লিষ্ট গুগলে সার্চ দিয়ে বের করে ফেলো। এবং এই asynchronous বলতে কি বুঝায় সেটাও দেখে রাখো। 

// ৮. event loop লুপ কি জিনিস। এই রিলেটেড পুরা জিনিসটা আজকে অনেকেই বুঝবে না। তাও আরেকবার দেখে রাখবে। 

// .

// [ চ্যালেঞ্জ ]

// ৯. ভিডিওতে চারটা লেভেল এর লোকাল স্টোরেজ রিলেটেড কাজ দেয়া হয়েছে। সেগুলা একটু ভালো করে করো। 

// ------------

// [মাস্ট করতেই হবে]

// ১০. stackoverflow নামে একটা ওয়েবসাইট আছে। সেখানে গিয়ে একাউণ্ট খুলবে। এবং মিনিমাম ৩০ মিনিট সেখানে স্পেন্ড করবে। দেখবে কিভাবে কি উত্তর দেয়। 



// দেখো এই ১০ টা কাজের মধ্যে কয়টা করতে পারো। প্রথমে নিজে নিজে চেষ্টা করো। দরকার হলে গুগলে সার্চ দাও। আমাদের ভিডিও না দেখেই করতে পারো কিনা দেখো। এরপরেও না পারলে বা সমস্যা হলে বসে থেকো না। গরূপে পোষ্ট দাও। সাপোর্ট সেশনে আসো। সমস্যা থাকলে আজকের মধ্যে সমাধান করে নাও। আগামীকাল আমরা খুবই মজার চমৎকার একটা জিনিস নিয়ে কাজ করবো। 

